---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexPosition
source: html/718e49aa-9e17-6f2d-2013-141b5cfeefdd.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPosition

A geometry vertex specified as a position in space.

## Syntax (C#)
```csharp
public class VertexPosition : Vertex
```

## Remarks
Since these vertices do not have a color
 their color is obtained from the EffectInstance